tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1764_tdd.h
#define SSP1MSK3                      522
#define MSK3                          523
#define SSP1MSK4                      524
#define MSK4                          525
#define SSP1MSK5                      526
#define MSK5                          527
#define SSP1MSK6                      528
#define MSK6                          529
#define SSP1MSK7                      530
#define MSK7                          531
#define SSP1STAT                      532
#define BF                            533
#define UA                            534
#define R_nW                          535
#define S                             536
#define P                             537
#define D_nA                          538
#define CKE                           539
#define SMP                           540
#define SSP1CON1                      541
#define SSPM0                         542
#define SSPM                          543
#define SSPM1                         544
#define SSPM2                         545
#define SSPM3                         546
#define CKP                           547
#define SSPEN                         548
#define SSPOV                         549
#define WCOL                          550
#define SSP1CON2                      551
#define SEN                           552
#define RSEN                          553
#define PEN                           554
#define RCEN                          555
#define ACKEN                         556
#define ACKDT                         557
#define ACKSTAT                       558
#define GCEN                          559
#define SSP1CON3                      560
#define DHEN                          561
#define AHEN                          562
#define SBCDE                         563
#define SDAHT                         564
#define BOEN                          565
#define SCIE                          566
#define PCIE                          567
#define ACKTIM                        568
#define BORCON                        569
#define BORRDY                        570
#define BORFS                         571
#define SBOREN                        572
#define FVRCON                        573
#define ADFVR                         574
#define CDAFVR                        575
#define TSRNG                         576
#define TSEN                          577
#define FVRRDY                        578
#define FVREN                         579
#define ZCD1CON                       580
#define ZCD1INTN                      581
#define ZCD1INTP                      582
#define ZCD1POL                       583
#define ZCD1OUT                       584
#define ZCD1EN                        585
#define ODCONA                        586
#define ODA0                          587
#define ODA1                          588
#define ODA2                          589
#define ODA4                          590
#define ODA5                          591
#define ODCONC                        592
#define ODC0                          593
#define ODC1                          594
#define ODC2                          595
#define ODC3                          596
#define ODC4                          597
#define ODC5                          598
#define CCPR1L                        599
#define RL                            600
#define CCPR1H                        601
#define RH                            602
#define CCP1CON                       603
#define CCP1CON_MODE                  604
#define CCP1CON_MODE0                 605
#define CCP1MODE                      606
#define CCP1MODE0                     607
#define CCP1MODE1                     608
#define CCP1CON_MODE1                 609
#define CCP1MODE2                     610
#define CCP1CON_MODE2                 611
#define CCP1MODE3                     612
#define CCP1CON_MODE3                 613
#define FMT                           614
#define CCP1FMT                       615
#define CCP1CON_OUT                   616
#define CCP1OUT                       617
#define CCP1EN                        618
#define CCP1CON_EN                    619
#define CCP1CAP                       620
#define CCP1CTS0                      621
#define CTS                           622
#define CCP1CTS                       623
#define CTS0                          624
#define CCP1CTS1                      625
#define CTS1                          626
#define CCP1CTS2                      627
#define CTS2                          628
#define CCPTMRS                       629
#define C1TSEL0                       630
#define C1TSEL                        631
#define C1TSEL1                       632
#define P3TSEL                        633
#define P3TSEL0                       634
#define P3TSEL1                       635
#define SLRCONA                       636
#define SLRA0                         637
#define SLRA1                         638
#define SLRA2                         639
#define SLRA4                         640
#define SLRA5                         641
#define SLRCONC                       642
#define SLRC0                         643
#define SLRC1                         644
#define SLRC2                         645
#define SLRC3                         646
#define SLRC4                         647
#define SLRC5                         648
#define INLVLA                        649
#define INLVLA0                       650
#define INLVLA1                       651
#define INLVLA2                       652
#define INLVLA3                       653
#define INLVLA4                       654
#define INLVLA5                       655
#define INLVLC                        656
#define INLVLC0                       657
#define INLVLC1                       658
#define INLVLC2                       659
#define INLVLC3                       660
#define INLVLC4                       661
#define INLVLC5                       662
#define IOCAP                         663
#define IOCAP0                        664
#define IOCAP1                        665
#define IOCAP2                        666
#define IOCAP3                        667
#define IOCAP4                        668
#define IOCAP5                        669
#define IOCAN                         670
#define IOCAN0                        671
#define IOCAN1                        672
#define IOCAN2                        673
#define IOCAN3                        674
#define IOCAN4                        675
#define IOCAN5                        676
#define IOCAF                         677
#define IOCAF0                        678
#define IOCAF1                        679
#define IOCAF2                        680
#define IOCAF3                        681
#define IOCAF4                        682
#define IOCAF5                        683
#define IOCCP                         684
#define IOCCP0                        685
#define IOCCP1                        686
#define IOCCP2                        687
#define IOCCP3                        688
#define IOCCP4                        689
#define IOCCP5                        690
#define IOCCN                         691
#define IOCCN0                        692
#define IOCCN1                        693
#define IOCCN2                        694
#define IOCCN3                        695
#define IOCCN4                        696
#define IOCCN5                        697
#define IOCCF                         698
#define IOCCF0                        699
#define IOCCF1                        700
#define IOCCF2                        701
#define IOCCF3                        702
#define IOCCF4                        703
#define IOCCF5                        704
#define MD1CON0                       705
#define MD1BIT                        706
#define BIT                           707
#define OPOL                          708
#define MD1OPOL                       709
#define MD1CON0_OUT                   710
#define MD1OUT                        711
#define MD1CON0_EN                    712
#define MD1EN                         713
#define MD1CON1                       714
#define MD1CLSYNC                     715
#define CLSYNC                        716
#define MD1CLPOL                      717
#define CLPOL                         718
#define MD1CHSYNC                     719
#define CHSYNC                        720
#define CHPOL                         721
#define MD1CHPOL                      722
#define MD1SRC                        723
#define MD1MS0                        724
#define MS0                           725
#define MS                            726
#define MD1MS                         727
#define MD1MS1                        728
#define MS1                           729
#define MD1MS2                        730
#define MS2                           731
#define MD1MS3                        732
#define MS3                           733
#define MD1MS4                        734
#define MS4                           735
#define MD1CARL                       736
#define CL                            737
#define MD1CL                         738
#define MD1CL0                        739
#define CL0                           740
#define MD1CL1                        741
#define CL1                           742
#define MD1CL2                        743
#define CL2                           744
#define MD1CL3                        745
#define CL3                           746
#define MD1CARH                       747
#define CH                            748
#define MD1CH                         749
#define MD1CH0                        750
#define CH0                           751
#define MD1CH1                        752
#define CH1                           753
#define MD1CH2                        754
#define CH2                           755
#define MD1CH3                        756
#define CH3                           757
#define HIDRVC                        758
#define HIDC4                         759
#define HIDC5                         760
#define T4TMR                         761
#define TMR4                          762
#define T4TMR_TMR                     763
#define T4PR_PR                       764
#define T4PR                          765
#define T4CON                         766
#define T4CON_OUTPS                   767
#define T4OUTPS0                      768
#define T4OUTPS                       769
#define T4CON_OUTPS0                  770
#define T4OUTPS1                      771
#define T4CON_OUTPS1                  772
#define T4CON_OUTPS2                  773
#define T4OUTPS2                      774
#define T4OUTPS3                      775
#define T4CON_OUTPS3                  776
#define T4CKPS0                       777
#define T4CON_CKPS0                   778
#define T4CKPS                        779
#define T4CON_CKPS                    780
#define T4CKPS1                       781
#define T4CON_CKPS1                   782
#define T4CKPS2                       783
#define T4CON_CKPS2                   784
#define T4CON_ON                      785
#define T4ON                          786
#define TMR4ON                        787
#define T4HLT                         788
#define T4MODE                        789
#define T4HLT_MODE                    790
#define T4HLT_MODE0                   791
#define T4MODE0                       792
#define T4HLT_MODE1                   793
#define T4MODE1                       794
#define T4HLT_MODE2                   795
#define T4MODE2                       796
#define T4HLT_MODE3                   797
#define T4MODE3                       798
#define T4HLT_MODE4                   799
#define T4MODE4                       800
#define T4CKSYNC                      801
#define T4HLT_CKSYNC                  802
#define T4HLT_CKPOL                   803
#define T4CKPOL                       804
#define T4PSYNC                       805
#define T4HLT_PSYNC                   806
#define T4CLKCON                      807
#define T4CS                          808
#define T4CLKCON_CS                   809
#define T4CS0                         810
#define T4CLKCON_CS0                  811
#define T4CS1                         812
#define T4CLKCON_CS1                  813
#define T4CS2                         814
#define T4CLKCON_CS2                  815
#define T4CS3                         816
#define T4CLKCON_CS3                  817
#define T4RST                         818
#define T4RSEL0                       819
#define T4RSEL                        820
#define T4RST_RSEL                    821
#define T4RST_RSEL0                   822
#define T4RSEL1                       823
#define T4RST_RSEL1                   824
#define T4RSEL2                       825
#define T4RST_RSEL2                   826
#define T4RSEL3                       827
#define T4RST_RSEL3                   828
#define T6TMR                         829
#define TMR6                          830
#define T6TMR_TMR                     831
#define T6PR_PR                       832
#define T6PR                          833
#define T6CON                         834
#define T6CON_OUTPS0                  835
#define T6OUTPS                       836
#define T6CON_OUTPS                   837
#define T6OUTPS0                      838
#define T6CON_OUTPS1                  839
#define T6OUTPS1                      840
#define T6CON_OUTPS2                  841
#define T6OUTPS2                      842
#define T6CON_OUTPS3                  843
#define T6OUTPS3                      844
#define T6CON_CKPS0                   845
#define T6CKPS                        846
#define T6CKPS0                       847
#define T6CON_CKPS                    848
#define T6CON_CKPS1                   849
#define T6CKPS1                       850
#define T6CON_CKPS2                   851
#define T6CKPS2                       852
#define TMR6ON                        853
#define T6ON                          854
#define T6CON_ON                      855
#define T6HLT                         856
#define T6MODE0                       857
#define T6HLT_MODE0                   858
#define T6HLT_MODE                    859
#define T6MODE                        860
#define T6HLT_MODE1                   861
#define T6MODE1                       862
#define T6HLT_MODE2                   863
#define T6MODE2                       864
#define T6HLT_MODE3                   865
#define T6MODE3                       866
#define T6MODE4                       867
#define T6HLT_MODE4                   868
#define T6CKSYNC                      869
#define T6HLT_CKSYNC                  870
#define T6CKPOL                       871
#define T6HLT_CKPOL                   872
#define T6PSYNC                       873
#define T6HLT_PSYNC                   874
#define T6CLKCON                      875
#define T6CS                          876
#define T6CLKCON_CS                   877
#define T6CLKCON_CS0                  878
#define T6CS0                         879
#define T6CLKCON_CS1                  880
#define T6CS1                         881
#define T6CLKCON_CS2                  882
#define T6CS2                         883
#define T6CLKCON_CS3                  884
#define T6CS3                         885
#define T6RST                         886
#define T6RST_RSEL                    887
#define T6RST_RSEL0                   888
#define T6RSEL                        889
#define T6RSEL0                       890
#define T6RST_RSEL1                   891
#define T6RSEL1                       892
#define T6RSEL2                       893
#define T6RST_RSEL2                   894
#define T6RST_RSEL3                   895
#define T6RSEL3                       896
#define TMR3L                         897
#define TMR3L_TMR                     898
#define TMR3H                         899
#define TMR3H_TMR                     900
#define T3CON                         901
#define T3CON_TMRON                   902
#define TMR3ON                        903
#define T3CON_ON                      904
#define T3ON                          905
#define nT3SYNC                       906
#define T3CON_nSYNC                   907
#define T3CON_SYNC                    908
#define T3CON_CKPS0                   909
#define T3CKPS0                       910
#define T3CON_CKPS                    911
#define T3CON_CKPS1                   912
#define T3CKPS1                       913
#define TMR3CS0                       914
#define T3CON_CS0                     915
#define T3CS0                         916
#define T3CON_CS                      917
#define TMR3CS1                       918
#define T3CON_CS1                     919
#define T3CS1                         920
#define T3GCON                        921
#define T3GCON_GSS0                   922
#define T3GSS0                        923
#define T3GCON_GSS                    924
#define T3GCON_GSS1                   925
#define T3GSS1                        926
#define T3GCON_GVAL                   927
#define T3GVAL                        928
#define T3GCON_GGO_nDONE              929
#define T3GGO_nDONE                   930
#define T3GSPM                        931
#define T3GCON_GSPM                   932
#define T3GCON_GTM                    933
#define T3GTM                         934
#define T3GPOL                        935
#define T3GCON_GPOL                   936
#define TMR3GE                        937
#define T3GCON_GE                     938
#define T3GE                          939
#define TMR5L                         940
#define TMR5L_TMR                     941
#define TMR5H                         942
#define TMR5H_TMR                     943
#define T5CON                         944
#define TMR5ON                        945
#define T5CON_ON                      946
#define T5ON                          947
#define T5CON_TMRON                   948
#define T5CON_SYNC                    949
#define T5CON_nSYNC                   950
#define nT5SYNC                       951
#define T5CON_CKPS                    952
#define T5CON_CKPS0                   953
#define T5CKPS0                       954
#define T5CON_CKPS1                   955
#define T5CKPS1                       956
#define T5CON_CS                      957
#define T5CON_CS0                     958
#define T5CS0                         959
#define TMR5CS0                       960
#define T5CON_CS1                     961
#define T5CS1                         962
#define TMR5CS1                       963
#define T5GCON                        964
#define T5GSS0                        965
#define T5GCON_GSS0                   966
#define T5GCON_GSS                    967
#define T5GSS1                        968
#define T5GCON_GSS1                   969
#define T5GVAL                        970
#define T5GCON_GVAL                   971
#define T5GCON_GGO_nDONE              972
#define T5GGO_nDONE                   973
#define T5GSPM                        974
#define T5GCON_GSPM                   975
#define T5GTM                         976
#define T5GCON_GTM                    977
#define T5GPOL                        978
#define T5GCON_GPOL                   979
#define T5GE                          980
#define TMR5GE                        981
#define T5GCON_GE                     982
#define OPA1NCHS                      983
#define OPA1NCH                       984
#define OPA1NCHS_NCH                  985
#define OPA1PCHS                      986
#define OPA1PCHS_PCH                  987
#define OPA1PCH                       988
#define OPA1CON                       989
#define ORM0                          990
#define OPA1ORM0                      991
#define ORM                           992
#define OPA1ORM                       993
#define ORM1                          994
#define OPA1ORM1                      995
#define OPA1ORPOL                     996
#define ORPOL                         997
#define UG                            998
#define OPA1UG                        999
#define OPA1CON_EN                    1000
#define OPA1EN                        1001
#define OPA1ORS                       1002
#define ORS                           1003
#define DACLD                         1004
#define DAC1LD                        1005
#define DAC1CON0                      1006
#define DACNSS0                       1007
#define NSS0                          1008
#define DAC1CON0_DACNSS               1009
#define DAC1NSS                       1010
#define DAC1CON0_NSS                  1011
#define DAC1NSS0                      1012
#define DAC1CON0_DACPSS0              1013
#define DAC1CON0_PSS0                 1014
#define DAC1CON0_DACPSS               1015
#define DAC1CON0_PSS                  1016
#define DAC1PSS                       1017
#define DAC1PSS0                      1018
#define DAC1PSS1                      1019
#define DAC1CON0_DACPSS1              1020
#define DAC1CON0_PSS1                 1021
#define DAC1CON0_OE1                  1022
#define DAC1OE1                       1023
#define DAC1CON0_DACOE1               1024
#define DACOE                         1025
#define OE                            1026
#define FM                            1027
#define DACFM                         1028
#define DAC1FM                        1029
#define DAC1CON0_EN                   1030
#define DAC1CON0_DACEN                1031
#define DAC1EN                        1032
#define DAC1REFL                      1033
#define DAC1REF0                      1034
#define DAC1REFL_R0                   1035
#define DAC1REFL_REF0                 1036
#define DAC1R0                        1037
#define DAC1REF1                      1038
#define DAC1REFL_REF1                 1039
#define DAC1REFL_R1                   1040
#define DAC1R1                        1041
#define DAC1REF2                      1042
#define DAC1REFL_R2                   1043
#define DAC1REFL_REF2                 1044
#define DAC1R2                        1045
#define DAC1REF3                      1046
#define DAC1REFL_R3                   1047
#define DAC1REFL_REF3                 1048
#define DAC1R3                        1049
#define DAC1REF4                      1050
#define DAC1REFL_REF4                 1051
#define DAC1REFL_R4                   1052
#define DAC1R4                        1053
#define DAC1REF5                      1054
#define R5                            1055
#define DAC1REFL_REF5                 1056
#define DAC1R5                        1057
#define REF6                          1058
#define DAC1REF6                      1059
#define R6                            1060
#define DAC1R6                        1061
#define REF7                          1062
#define DAC1REF7                      1063
#define R7                            1064
#define DAC1R7                        1065
#define DAC1REFH                      1066
#define REF8                          1067
#define DAC1REF8                      1068
#define R8                            1069
#define DAC1R8                        1070
#define REF9                          1071
#define DAC1REF9                      1072
#define R9                            1073
#define DAC1R9                        1074
#define R10                           1075
#define REF10                         1076
#define DAC1R10                       1077
#define DAC1REF10                     1078
#define R11                           1079
#define REF11                         1080
#define DAC1R11                       1081
#define DAC1REF11                     1082
#define R12                           1083
#define REF12                         1084
#define DAC1REF12                     1085
#define DAC1R12                       1086
#define R13                           1087
#define REF13                         1088
#define DAC1R13                       1089
#define DAC1REF13                     1090
