tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1764_tdd.h
#define R14                           1091
#define REF14                         1092
#define DAC1R14                       1093
#define DAC1REF14                     1094
#define R15                           1095
#define REF15                         1096
#define DAC1R15                       1097
#define DAC1REF15                     1098
#define DAC3CON0                      1099
#define DAC3CON0_DACNSS               1100
#define DAC3NSS                       1101
#define DAC3CON0_NSS                  1102
#define DAC3CON0_PSS                  1103
#define DAC3PSS0                      1104
#define DAC3CON0_DACPSS               1105
#define DAC3PSS                       1106
#define DAC3CON0_PSS0                 1107
#define DAC3CON0_DACPSS0              1108
#define DAC3PSS1                      1109
#define DAC3CON0_PSS1                 1110
#define DAC3CON0_DACPSS1              1111
#define DAC3OE1                       1112
#define DAC3CON0_DACOE1               1113
#define DAC3CON0_OE1                  1114
#define DAC3EN                        1115
#define DAC3CON0_EN                   1116
#define DAC3CON0_DACEN                1117
#define DAC3REF                       1118
#define DAC3REF0                      1119
#define DAC3R                         1120
#define DACR0                         1121
#define DAC3REF_R0                    1122
#define DACR                          1123
#define DAC3REF_REF0                  1124
#define DAC3R0                        1125
#define DAC3REF1                      1126
#define DACR1                         1127
#define DAC3REF_R1                    1128
#define DAC3REF_REF1                  1129
#define DAC3R1                        1130
#define DAC3REF2                      1131
#define DACR2                         1132
#define DAC3REF_R2                    1133
#define DAC3REF_REF2                  1134
#define DAC3R2                        1135
#define DAC3REF3                      1136
#define DACR3                         1137
#define DAC3REF_REF3                  1138
#define DAC3REF_R3                    1139
#define DAC3R3                        1140
#define DAC3REF4                      1141
#define DACR4                         1142
#define DAC3REF_R4                    1143
#define DAC3REF_REF4                  1144
#define DAC3R4                        1145
#define DAC3REF5                      1146
#define DAC3REF_REF5                  1147
#define PWM3DCL                       1148
#define PWM3DC0                       1149
#define PWMPW0                        1150
#define PWM3DCL_DC                    1151
#define DC0                           1152
#define PWM3DC1                       1153
#define PWMPW1                        1154
#define DC1                           1155
#define PWM3DCH                       1156
#define PWM3DC2                       1157
#define PWMPW2                        1158
#define PWM3DCH_DC                    1159
#define DC2                           1160
#define PWM3DC3                       1161
#define PWMPW3                        1162
#define DC3                           1163
#define PWM3DC4                       1164
#define PWMPW4                        1165
#define DC4                           1166
#define PWM3DC5                       1167
#define PWMPW5                        1168
#define DC5                           1169
#define PWM3DC6                       1170
#define PWMPW6                        1171
#define DC6                           1172
#define PWM3DC7                       1173
#define PWMPW7                        1174
#define DC7                           1175
#define PWMPW8                        1176
#define PWM3DC8                       1177
#define DC8                           1178
#define PWMPW9                        1179
#define PWM3DC9                       1180
#define DC9                           1181
#define PWM3CON                       1182
#define PWM3CON_POL                   1183
#define PWM3POL                       1184
#define PWM3CON_OUT                   1185
#define PWM3OUT                       1186
#define PWM3EN                        1187
#define PWM3CON_EN                    1188
#define COG1PHR                       1189
#define G1PHR0                        1190
#define PHR                           1191
#define PHR0                          1192
#define G1PHR1                        1193
#define PHR1                          1194
#define G1PHR2                        1195
#define PHR2                          1196
#define G1PHR3                        1197
#define PHR3                          1198
#define G1PHR4                        1199
#define PHR4                          1200
#define G1PHR5                        1201
#define PHR5                          1202
#define COG1PHF                       1203
#define G1PHF0                        1204
#define PHF                           1205
#define PHF0                          1206
#define G1PHF1                        1207
#define PHF1                          1208
#define G1PHF2                        1209
#define PHF2                          1210
#define G1PHF3                        1211
#define PHF3                          1212
#define G1PHF4                        1213
#define PHF4                          1214
#define G1PHF5                        1215
#define PHF5                          1216
#define COG1BLKR                      1217
#define BLKR                          1218
#define BLKR0                         1219
#define G1BLKR0                       1220
#define BLKR1                         1221
#define G1BLKR1                       1222
#define BLKR2                         1223
#define G1BLKR2                       1224
#define BLKR3                         1225
#define G1BLKR3                       1226
#define BLKR4                         1227
#define G1BLKR4                       1228
#define BLKR5                         1229
#define G1BLKR5                       1230
#define COG1BLKF                      1231
#define BLKF                          1232
#define G1BLKF0                       1233
#define BLKF0                         1234
#define G1BLKF1                       1235
#define BLKF1                         1236
#define G1BLKF2                       1237
#define BLKF2                         1238
#define G1BLKF3                       1239
#define BLKF3                         1240
#define G1BLKF4                       1241
#define BLKF4                         1242
#define G1BLKF5                       1243
#define BLKF5                         1244
#define COG1DBR                       1245
#define G1DBR0                        1246
#define DBR                           1247
#define DBR0                          1248
#define G1DBR1                        1249
#define DBR1                          1250
#define G1DBR2                        1251
#define DBR2                          1252
#define G1DBR3                        1253
#define DBR3                          1254
#define G1DBR4                        1255
#define DBR4                          1256
#define G1DBR5                        1257
#define DBR5                          1258
#define COG1DBF                       1259
#define G1DBF0                        1260
#define DBF0                          1261
#define G1DBF                         1262
#define G1DBF1                        1263
#define DBF1                          1264
#define G1DBF2                        1265
#define DBF2                          1266
#define G1DBF3                        1267
#define DBF3                          1268
#define G1DBF4                        1269
#define DBF4                          1270
#define G1DBF5                        1271
#define DBF5                          1272
#define COG1CON0                      1273
#define G1MD0                         1274
#define MD0                           1275
#define MD                            1276
#define G1MD                          1277
#define G1MD1                         1278
#define MD1                           1279
#define G1MD2                         1280
#define MD2                           1281
#define COG1CON0_CS0                  1282
#define G1CS                          1283
#define G1CS0                         1284
#define COG1CON0_CS                   1285
#define COG1CON0_CS1                  1286
#define G1CS1                         1287
#define G1LD                          1288
#define LD                            1289
#define COG1CON0_EN                   1290
#define G1EN                          1291
#define COG1CON1                      1292
#define G1POLA                        1293
#define POLA                          1294
#define POLB                          1295
#define G1POLB                        1296
#define G1POLC                        1297
#define POLC                          1298
#define POLD                          1299
#define G1POLD                        1300
#define G1FDBS                        1301
#define FDBS                          1302
#define RDBS                          1303
#define G1RDBS                        1304
#define COG1RIS0                      1305
#define G1RIS0                        1306
#define RIS0                          1307
#define G1RIS1                        1308
#define RIS1                          1309
#define G1RIS2                        1310
#define RIS2                          1311
#define G1RIS3                        1312
#define RIS3                          1313
#define G1RIS4                        1314
#define RIS4                          1315
#define G1RIS5                        1316
#define RIS5                          1317
#define G1RIS6                        1318
#define RIS6                          1319
#define G1RIS7                        1320
#define RIS7                          1321
#define COG1RIS1                      1322
#define G1RIS8                        1323
#define RIS8                          1324
#define G1RIS9                        1325
#define RIS9                          1326
#define RIS10                         1327
#define G1RIS10                       1328
#define RIS11                         1329
#define G1RIS11                       1330
#define RIS12                         1331
#define G1RIS12                       1332
#define RIS13                         1333
#define G1RIS13                       1334
#define RIS14                         1335
#define G1RIS14                       1336
#define COG1RSIM0                     1337
#define G1RSIM0                       1338
#define RSIM0                         1339
#define G1RSIM1                       1340
#define RSIM1                         1341
#define G1RSIM2                       1342
#define RSIM2                         1343
#define G1RSIM3                       1344
#define RSIM3                         1345
#define G1RSIM4                       1346
#define RSIM4                         1347
#define G1RSIM5                       1348
#define RSIM5                         1349
#define G1RSIM6                       1350
#define RSIM6                         1351
#define G1RSIM7                       1352
#define RSIM7                         1353
#define COG1RSIM1                     1354
#define RSIM8                         1355
#define G1RSIM8                       1356
#define RSIM9                         1357
#define G1RSIM9                       1358
#define RSIM10                        1359
#define G1RSIM10                      1360
#define RSIM11                        1361
#define G1RSIM11                      1362
#define RSIM12                        1363
#define G1RSIM12                      1364
#define RSIM13                        1365
#define G1RSIM13                      1366
#define RSIM14                        1367
#define G1RSIM14                      1368
#define COG1FIS0                      1369
#define FIS0                          1370
#define G1FIS0                        1371
#define FIS1                          1372
#define G1FIS1                        1373
#define G1FIS2                        1374
#define FIS2                          1375
#define G1FIS3                        1376
#define FIS3                          1377
#define G1FIS4                        1378
#define FIS4                          1379
#define G1FIS5                        1380
#define FIS5                          1381
#define G1FIS6                        1382
#define FIS6                          1383
#define FIS7                          1384
#define G1FIS7                        1385
#define COG1FIS1                      1386
#define FIS8                          1387
#define G1FIS8                        1388
#define FIS9                          1389
#define G1FIS9                        1390
#define G1FIS10                       1391
#define FIS10                         1392
#define G1FIS11                       1393
#define FIS11                         1394
#define G1FIS12                       1395
#define FIS12                         1396
#define G1FIS13                       1397
#define FIS13                         1398
#define G1FIS14                       1399
#define FIS14                         1400
#define COG1FSIM0                     1401
#define G1FSIM0                       1402
#define FSIM0                         1403
#define G1FSIM1                       1404
#define FSIM1                         1405
#define G1FSIM2                       1406
#define FSIM2                         1407
#define G1FSIM3                       1408
#define FSIM3                         1409
#define G1FSIM4                       1410
#define FSIM4                         1411
#define G1FSIM5                       1412
#define FSIM5                         1413
#define G1FSIM6                       1414
#define FSIM6                         1415
#define G1FSIM7                       1416
#define FSIM7                         1417
#define COG1FSIM1                     1418
#define FSIM8                         1419
#define G1FSIM8                       1420
#define FSIM9                         1421
#define G1FSIM9                       1422
#define FSIM10                        1423
#define G1FSIM10                      1424
#define FSIM11                        1425
#define G1FSIM11                      1426
#define FSIM12                        1427
#define G1FSIM12                      1428
#define FSIM13                        1429
#define G1FSIM13                      1430
#define FSIM14                        1431
#define G1FSIM14                      1432
#define COG1ASD0                      1433
#define ASDAC0                        1434
#define G1ASDAC0                      1435
#define ASDAC                         1436
#define G1ASDAC                       1437
#define G1ASDAC1                      1438
#define ASDAC1                        1439
#define G1ASDBD0                      1440
#define ASDBD0                        1441
#define ASDBD                         1442
#define G1ASDBD                       1443
#define ASDBD1                        1444
#define G1ASDBD1                      1445
#define ASREN                         1446
#define ARSEN                         1447
#define G1ARSEN                       1448
#define G1ASREN                       1449
#define ASE                           1450
#define G1ASE                         1451
#define COG1ASD1                      1452
#define AS0E                          1453
#define G1AS0E                        1454
#define AS1E                          1455
#define G1AS1E                        1456
#define AS2E                          1457
#define G1AS2E                        1458
#define AS3E                          1459
#define G1AS3E                        1460
#define AS4E                          1461
#define G1AS4E                        1462
#define AS5E                          1463
#define G1AS5E                        1464
#define AS6E                          1465
#define G1AS6E                        1466
#define G1AS7E                        1467
#define AS7E                          1468
#define COG1STR                       1469
#define STRA                          1470
#define G1STRA                        1471
#define STRB                          1472
#define G1STRB                        1473
#define STRC                          1474
#define G1STRC                        1475
#define G1STRD                        1476
#define STRD                          1477
#define SDATA                         1478
#define G1SDATA                       1479
#define SDATB                         1480
#define G1SDATB                       1481
#define G1SDATC                       1482
#define SDATC                         1483
#define SDATD                         1484
#define G1SDATD                       1485
#define PRG1RTSS                      1486
#define RTSS                          1487
#define RG1RTSS0                      1488
#define RTSS0                         1489
#define RG1RTSS1                      1490
#define RTSS1                         1491
#define RG1RTSS2                      1492
#define RTSS2                         1493
#define RG1RTSS3                      1494
#define RTSS3                         1495
#define PRG1FTSS                      1496
#define RG1FTSS0                      1497
#define FTSS0                         1498
#define FTSS                          1499
#define RG1FTSS1                      1500
#define FTSS1                         1501
#define RG1FTSS2                      1502
#define FTSS2                         1503
#define RG1FTSS3                      1504
#define FTSS3                         1505
#define PRG1INS                       1506
#define INS                           1507
#define INS0                          1508
#define RG1INS0                       1509
#define INS1                          1510
#define RG1INS1                       1511
#define INS2                          1512
#define RG1INS2                       1513
#define INS3                          1514
#define RG1INS3                       1515
#define PRG1CON0                      1516
#define RG1GO                         1517
#define PRG1CON0_GO                   1518
#define RG1OS                         1519
#define OS                            1520
#define RG1MODE                       1521
#define PRG1CON0_MODE0                1522
#define PRG1CON0_MODE                 1523
#define RG1MODE0                      1524
#define PRG1CON0_MODE1                1525
#define RG1MODE1                      1526
#define RG1REDG                       1527
#define REDG                          1528
#define FEDG                          1529
#define RG1FEDG                       1530
#define RG1EN                         1531
#define PRG1CON0_EN                   1532
#define PRG1CON1                      1533
#define RG1RPOL                       1534
#define RPOL                          1535
#define FPOL                          1536
#define RG1FPOL                       1537
#define RDY                           1538
#define RG1RDY                        1539
#define PRG1CON2                      1540
#define RG1ISET0                      1541
#define ISET                          1542
#define RG1ISET                       1543
#define ISET0                         1544
#define RG1ISET1                      1545
#define ISET1                         1546
#define RG1ISET2                      1547
#define ISET2                         1548
#define RG1ISET3                      1549
#define ISET3                         1550
#define RG1ISET4                      1551
#define ISET4                         1552
#define PWMEN                         1553
#define MPWM5EN                       1554
#define PWMLD                         1555
#define MPWM5LD                       1556
#define PWMOUT                        1557
#define MPWM5OUT                      1558
#define PWM5PHL0                      1559
#define PWM5PHL_PH                    1560
#define PWM5PHL                       1561
#define PWM5PHL1                      1562
#define PWM5PHL2                      1563
#define PWM5PHL3                      1564
#define PWM5PHL4                      1565
#define PWM5PHL5                      1566
#define PWM5PHL6                      1567
#define PWM5PHL7                      1568
#define PWM5PHH0                      1569
#define PWM5PHH_PH                    1570
#define PWM5PHH                       1571
#define PWM5PHH1                      1572
#define PWM5PHH2                      1573
#define PWM5PHH3                      1574
#define PWM5PHH4                      1575
#define PWM5PHH5                      1576
#define PWM5PHH6                      1577
#define PWM5PHH7                      1578
#define PWM5DCL_DC                    1579
#define PWM5DCL                       1580
#define PWM5DCL0                      1581
#define PWM5DCL1                      1582
#define PWM5DCL2                      1583
#define PWM5DCL3                      1584
#define PWM5DCL4                      1585
#define PWM5DCL5                      1586
#define PWM5DCL6                      1587
#define PWM5DCL7                      1588
#define PWM5DCH_DC                    1589
#define PWM5DCH                       1590
#define PWM5DCH0                      1591
#define PWM5DCH1                      1592
#define PWM5DCH2                      1593
#define PWM5DCH3                      1594
#define PWM5DCH4                      1595
#define PWM5DCH5                      1596
#define PWM5DCH6                      1597
#define PWM5DCH7                      1598
#define PWM5PRL0                      1599
#define PWM5PRL_PR                    1600
#define PWM5PRL                       1601
#define PWM5PRL1                      1602
#define PWM5PRL2                      1603
#define PWM5PRL3                      1604
#define PWM5PRL4                      1605
#define PWM5PRL5                      1606
#define PWM5PRL6                      1607
#define PWM5PRL7                      1608
#define PWM5PRH_PR                    1609
#define PWM5PRH0                      1610
#define PWM5PRH                       1611
#define PWM5PRH1                      1612
#define PWM5PRH2                      1613
#define PWM5PRH3                      1614
#define PWM5PRH4                      1615
#define PWM5PRH5                      1616
#define PWM5PRH6                      1617
#define PWM5PRH7                      1618
#define PWM5OFL                       1619
#define PWM5OFL0                      1620
#define PWM5OFL_OF                    1621
#define PWM5OFL1                      1622
#define PWM5OFL2                      1623
#define PWM5OFL3                      1624
#define PWM5OFL4                      1625
#define PWM5OFL5                      1626
#define PWM5OFL6                      1627
#define PWM5OFL7                      1628
#define PWM5OFH_OF                    1629
#define PWM5OFH                       1630
#define PWM5OFH0                      1631
#define PWM5OFH1                      1632
#define PWM5OFH2                      1633
#define PWM5OFH3                      1634
#define PWM5OFH4                      1635
#define PWM5OFH5                      1636
#define PWM5OFH6                      1637
#define PWM5OFH7                      1638
#define PWM5TMRL_TMR                  1639
#define PWM5TMRL                      1640
#define PWM5TMRL0                     1641
#define PWM5TMRL1                     1642
#define PWM5TMRL2                     1643
#define PWM5TMRL3                     1644
#define PWM5TMRL4                     1645
#define PWM5TMRL5                     1646
#define PWM5TMRL6                     1647
#define PWM5TMRL7                     1648
