tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1764_tdd.h
#define PWM5TMRH0                     1649
#define PWM5TMRH                      1650
#define PWM5TMRH_TMR                  1651
#define PWM5TMRH1                     1652
#define PWM5TMRH2                     1653
#define PWM5TMRH3                     1654
#define PWM5TMRH4                     1655
#define PWM5TMRH5                     1656
#define PWM5TMRH6                     1657
#define PWM5TMRH7                     1658
#define PWM5CON                       1659
#define PWM5MODE0                     1660
#define PWM5CON_MODE                  1661
#define PWM5CON_MODE0                 1662
#define PWM5MODE                      1663
#define PWM5MODE1                     1664
#define PWM5CON_MODE1                 1665
#define PWM5POL                       1666
#define PWM5CON_POL                   1667
#define PWM5OUT                       1668
#define PWM5CON_OUT                   1669
#define PWM5EN                        1670
#define PWM5CON_EN                    1671
#define PWM5INTE                      1672
#define PRIE                          1673
#define PWM5PRIE                      1674
#define DCIE                          1675
#define PWM5DCIE                      1676
#define PHIE                          1677
#define PWM5PHIE                      1678
#define PWM5OFIE                      1679
#define OFIE                          1680
#define PWM5INTF                      1681
#define PRIF                          1682
#define PWM5PRIF                      1683
#define DCIF                          1684
#define PWM5DCIF                      1685
#define PHIF                          1686
#define PWM5PHIF                      1687
#define PWM5OFIF                      1688
#define OFIF                          1689
#define PWM5CLKCON                    1690
#define PWM5CS0                       1691
#define PWM5CLKCON_CS0                1692
#define PWM5CS                        1693
#define PWM5CLKCON_CS                 1694
#define PWM5CS1                       1695
#define PWM5CLKCON_CS1                1696
#define PWM5CS2                       1697
#define PWM5CLKCON_CS2                1698
#define PWM5PS                        1699
#define PWM5CLKCON_PS0                1700
#define PWM5PS0                       1701
#define PWM5CLKCON_PS                 1702
#define PWM5CLKCON_PS1                1703
#define PWM5PS1                       1704
#define PWM5CLKCON_PS2                1705
#define PWM5PS2                       1706
#define PWM5LDCON                     1707
#define LDA                           1708
#define PWM5LD                        1709
#define PWM5OFCON                     1710
#define OFO                           1711
#define PWM5OFMC                      1712
#define PPSLOCK                       1713
#define PPSLOCKED                     1714
#define INTPPS                        1715
#define T0CKIPPS                      1716
#define T1CKIPPS                      1717
#define T1GPPS                        1718
#define CCP1PPS                       1719
#define COG1INPPS                     1720
#define T2INPPS                       1721
#define T3CKIPPS                      1722
#define T3GPPS                        1723
#define T4INPPS                       1724
#define T5CKIPPS                      1725
#define T5GPPS                        1726
#define T6INPPS                       1727
#define SSPCLKPPS                     1728
#define SSPDATPPS                     1729
#define SSPSSPPS                      1730
#define RXPPS                         1731
#define CKPPS                         1732
#define CLCIN0PPS                     1733
#define CLCIN1PPS                     1734
#define CLCIN2PPS                     1735
#define CLCIN3PPS                     1736
#define PRG1RPPS                      1737
#define PRG1FPPS                      1738
#define MD1CHPPS                      1739
#define MD1CLPPS                      1740
#define MD1MODPPS                     1741
#define RA0PPS                        1742
#define RA1PPS                        1743
#define RA2PPS                        1744
#define RA4PPS                        1745
#define RA5PPS                        1746
#define RC0PPS                        1747
#define RC1PPS                        1748
#define RC2PPS                        1749
#define RC3PPS                        1750
#define RC4PPS                        1751
#define RC5PPS                        1752
#define CLCDATA                       1753
#define MCLC1OUT                      1754
#define MCLC2OUT                      1755
#define MCLC3OUT                      1756
#define CLC1CON                       1757
#define CLC1CON_MODE                  1758
#define LC1MODE0                      1759
#define LC1MODE                       1760
#define CLC1CON_MODE0                 1761
#define LC1MODE1                      1762
#define CLC1CON_MODE1                 1763
#define LC1MODE2                      1764
#define CLC1CON_MODE2                 1765
#define LC1INTN                       1766
#define CLC1CON_INTN                  1767
#define LC1INTP                       1768
#define CLC1CON_INTP                  1769
#define LC1OUT                        1770
#define CLC1CON_OUT                   1771
#define LC1EN                         1772
#define CLC1CON_EN                    1773
#define CLC1POL                       1774
#define LC1G1POL                      1775
#define CLC1POL_G1POL                 1776
#define CLC1POL_G2POL                 1777
#define LC1G2POL                      1778
#define LC1G3POL                      1779
#define CLC1POL_G3POL                 1780
#define LC1G4POL                      1781
#define CLC1POL_G4POL                 1782
#define CLC1POL_POL                   1783
#define LC1POL                        1784
#define CLC1SEL0                      1785
#define CLC1SEL0_D1S0                 1786
#define LC1D1S                        1787
#define LC1D1S0                       1788
#define CLC1SEL0_D1S                  1789
#define CLC1SEL0_D1S1                 1790
#define LC1D1S1                       1791
#define CLC1SEL0_D1S2                 1792
#define LC1D1S2                       1793
#define CLC1SEL0_D1S3                 1794
#define LC1D1S3                       1795
#define CLC1SEL0_D1S4                 1796
#define LC1D1S4                       1797
#define CLC1SEL1                      1798
#define CLC1SEL1_D2S0                 1799
#define CLC1SEL1_D2S                  1800
#define LC1D2S                        1801
#define LC1D2S0                       1802
#define CLC1SEL1_D2S1                 1803
#define LC1D2S1                       1804
#define LC1D2S2                       1805
#define CLC1SEL1_D2S2                 1806
#define LC1D2S3                       1807
#define CLC1SEL1_D2S3                 1808
#define LC1D2S4                       1809
#define CLC1SEL1_D2S4                 1810
#define CLC1SEL2                      1811
#define LC1D3S0                       1812
#define CLC1SEL2_D3S                  1813
#define LC1D3S                        1814
#define CLC1SEL2_D3S0                 1815
#define LC1D3S1                       1816
#define CLC1SEL2_D3S1                 1817
#define LC1D3S2                       1818
#define CLC1SEL2_D3S2                 1819
#define LC1D3S3                       1820
#define CLC1SEL2_D3S3                 1821
#define LC1D3S4                       1822
#define CLC1SEL2_D3S4                 1823
#define CLC1SEL3                      1824
#define CLC1SEL3_D4S                  1825
#define LC1D4S                        1826
#define LC1D4S0                       1827
#define CLC1SEL3_D4S0                 1828
#define CLC1SEL3_D4S1                 1829
#define LC1D4S1                       1830
#define LC1D4S2                       1831
#define CLC1SEL3_D4S2                 1832
#define LC1D4S3                       1833
#define CLC1SEL3_D4S3                 1834
#define LC1D4S4                       1835
#define CLC1SEL3_D4S4                 1836
#define CLC1GLS0                      1837
#define CLC1GLS0_D1N                  1838
#define LC1G1D1N                      1839
#define CLC1GLS0_D1T                  1840
#define LC1G1D1T                      1841
#define LC1G1D2N                      1842
#define CLC1GLS0_D2N                  1843
#define LC1G1D2T                      1844
#define CLC1GLS0_D2T                  1845
#define CLC1GLS0_D3N                  1846
#define LC1G1D3N                      1847
#define CLC1GLS0_D3T                  1848
#define LC1G1D3T                      1849
#define CLC1GLS0_D4N                  1850
#define LC1G1D4N                      1851
#define CLC1GLS0_D4T                  1852
#define LC1G1D4T                      1853
#define CLC1GLS1                      1854
#define CLC1GLS1_D1N                  1855
#define LC1G2D1N                      1856
#define LC1G2D1T                      1857
#define CLC1GLS1_D1T                  1858
#define CLC1GLS1_D2N                  1859
#define LC1G2D2N                      1860
#define LC1G2D2T                      1861
#define CLC1GLS1_D2T                  1862
#define CLC1GLS1_D3N                  1863
#define LC1G2D3N                      1864
#define LC1G2D3T                      1865
#define CLC1GLS1_D3T                  1866
#define CLC1GLS1_D4N                  1867
#define LC1G2D4N                      1868
#define LC1G2D4T                      1869
#define CLC1GLS1_D4T                  1870
#define CLC1GLS2                      1871
#define CLC1GLS2_D1N                  1872
#define LC1G3D1N                      1873
#define LC1G3D1T                      1874
#define CLC1GLS2_D1T                  1875
#define LC1G3D2N                      1876
#define CLC1GLS2_D2N                  1877
#define LC1G3D2T                      1878
#define CLC1GLS2_D2T                  1879
#define CLC1GLS2_D3N                  1880
#define LC1G3D3N                      1881
#define LC1G3D3T                      1882
#define CLC1GLS2_D3T                  1883
#define LC1G3D4N                      1884
#define CLC1GLS2_D4N                  1885
#define LC1G3D4T                      1886
#define CLC1GLS2_D4T                  1887
#define CLC1GLS3                      1888
#define LC1G4D1N                      1889
#define CLC1GLS3_G4D1N                1890
#define LC1G4D1T                      1891
#define CLC1GLS3_G4D1T                1892
#define CLC1GLS3_G4D2N                1893
#define LC1G4D2N                      1894
#define CLC1GLS3_G4D2T                1895
#define LC1G4D2T                      1896
#define LC1G4D3N                      1897
#define CLC1GLS3_G4D3N                1898
#define LC1G4D3T                      1899
#define CLC1GLS3_G4D3T                1900
#define CLC1GLS3_G4D4N                1901
#define LC1G4D4N                      1902
#define CLC1GLS3_G4D4T                1903
#define LC1G4D4T                      1904
#define CLC2CON                       1905
#define LC2MODE0                      1906
#define CLC2CON_MODE                  1907
#define LC2MODE                       1908
#define CLC2CON_MODE0                 1909
#define LC2MODE1                      1910
#define CLC2CON_MODE1                 1911
#define LC2MODE2                      1912
#define CLC2CON_MODE2                 1913
#define LC2INTN                       1914
#define CLC2CON_INTN                  1915
#define LC2INTP                       1916
#define CLC2CON_INTP                  1917
#define CLC2CON_OUT                   1918
#define LC2OUT                        1919
#define CLC2CON_EN                    1920
#define LC2EN                         1921
#define CLC2POL                       1922
#define LC2G1POL                      1923
#define CLC2POL_G1POL                 1924
#define LC2G2POL                      1925
#define CLC2POL_G2POL                 1926
#define LC2G3POL                      1927
#define CLC2POL_G3POL                 1928
#define LC2G4POL                      1929
#define CLC2POL_G4POL                 1930
#define CLC2POL_POL                   1931
#define LC2POL                        1932
#define CLC2SEL0                      1933
#define CLC2SEL0_D1S                  1934
#define LC2D1S0                       1935
#define CLC2SEL0_D1S0                 1936
#define LC2D1S                        1937
#define LC2D1S1                       1938
#define CLC2SEL0_D1S1                 1939
#define LC2D1S2                       1940
#define CLC2SEL0_D1S2                 1941
#define CLC2SEL0_D1S3                 1942
#define LC2D1S3                       1943
#define LC2D1S4                       1944
#define CLC2SEL0_D1S4                 1945
#define CLC2SEL1                      1946
#define LC2D2S0                       1947
#define CLC2SEL1_D2S0                 1948
#define LC2D2S                        1949
#define CLC2SEL1_D2S                  1950
#define LC2D2S1                       1951
#define CLC2SEL1_D2S1                 1952
#define LC2D2S2                       1953
#define CLC2SEL1_D2S2                 1954
#define LC2D2S3                       1955
#define CLC2SEL1_D2S3                 1956
#define LC2D2S4                       1957
#define CLC2SEL1_D2S4                 1958
#define CLC2SEL2                      1959
#define CLC2SEL2_D3S                  1960
#define LC2D3S0                       1961
#define CLC2SEL2_D3S0                 1962
#define LC2D3S                        1963
#define CLC2SEL2_D3S1                 1964
#define LC2D3S1                       1965
#define LC2D3S2                       1966
#define CLC2SEL2_D3S2                 1967
#define LC2D3S3                       1968
#define CLC2SEL2_D3S3                 1969
#define LC2D3S4                       1970
#define CLC2SEL2_D3S4                 1971
#define CLC2SEL3                      1972
#define LC2D4S                        1973
#define LC2D4S0                       1974
#define CLC2SEL3_D4S                  1975
#define CLC2SEL3_D4S0                 1976
#define LC2D4S1                       1977
#define CLC2SEL3_D4S1                 1978
#define LC2D4S2                       1979
#define CLC2SEL3_D4S2                 1980
#define CLC2SEL3_D4S3                 1981
#define LC2D4S3                       1982
#define LC2D4S4                       1983
#define CLC2SEL3_D4S4                 1984
#define CLC2GLS0                      1985
#define LC2G1D1N                      1986
#define CLC2GLS0_D1N                  1987
#define CLC2GLS0_D1T                  1988
#define LC2G1D1T                      1989
#define LC2G1D2N                      1990
#define CLC2GLS0_D2N                  1991
#define CLC2GLS0_D2T                  1992
#define LC2G1D2T                      1993
#define LC2G1D3N                      1994
#define CLC2GLS0_D3N                  1995
#define CLC2GLS0_D3T                  1996
#define LC2G1D3T                      1997
#define LC2G1D4N                      1998
#define CLC2GLS0_D4N                  1999
#define CLC2GLS0_D4T                  2000
#define LC2G1D4T                      2001
#define CLC2GLS1                      2002
#define CLC2GLS1_D1N                  2003
#define LC2G2D1N                      2004
#define CLC2GLS1_D1T                  2005
#define LC2G2D1T                      2006
#define CLC2GLS1_D2N                  2007
#define LC2G2D2N                      2008
#define CLC2GLS1_D2T                  2009
#define LC2G2D2T                      2010
#define LC2G2D3N                      2011
#define CLC2GLS1_D3N                  2012
#define LC2G2D3T                      2013
#define CLC2GLS1_D3T                  2014
#define LC2G2D4N                      2015
#define CLC2GLS1_D4N                  2016
#define LC2G2D4T                      2017
#define CLC2GLS1_D4T                  2018
#define CLC2GLS2                      2019
#define LC2G3D1N                      2020
#define CLC2GLS2_D1N                  2021
#define CLC2GLS2_D1T                  2022
#define LC2G3D1T                      2023
#define CLC2GLS2_D2N                  2024
#define LC2G3D2N                      2025
#define LC2G3D2T                      2026
#define CLC2GLS2_D2T                  2027
#define CLC2GLS2_D3N                  2028
#define LC2G3D3N                      2029
#define CLC2GLS2_D3T                  2030
#define LC2G3D3T                      2031
#define CLC2GLS2_D4N                  2032
#define LC2G3D4N                      2033
#define LC2G3D4T                      2034
#define CLC2GLS2_D4T                  2035
#define CLC2GLS3                      2036
#define LC2G4D1N                      2037
#define CLC2GLS3_G4D1N                2038
#define CLC2GLS3_G4D1T                2039
#define LC2G4D1T                      2040
#define CLC2GLS3_G4D2N                2041
#define LC2G4D2N                      2042
#define LC2G4D2T                      2043
#define CLC2GLS3_G4D2T                2044
#define CLC2GLS3_G4D3N                2045
#define LC2G4D3N                      2046
#define CLC2GLS3_G4D3T                2047
#define LC2G4D3T                      2048
#define LC2G4D4N                      2049
#define CLC2GLS3_G4D4N                2050
#define CLC2GLS3_G4D4T                2051
#define LC2G4D4T                      2052
#define CLC3CON                       2053
#define LC3MODE                       2054
#define CLC3CON_MODE0                 2055
#define LC3MODE0                      2056
#define CLC3CON_MODE                  2057
#define CLC3CON_MODE1                 2058
#define LC3MODE1                      2059
#define CLC3CON_MODE2                 2060
#define LC3MODE2                      2061
#define LC3INTN                       2062
#define CLC3CON_INTN                  2063
#define LC3INTP                       2064
#define CLC3CON_INTP                  2065
#define LC3OUT                        2066
#define CLC3CON_OUT                   2067
#define LC3EN                         2068
#define CLC3CON_EN                    2069
#define CLC3POL                       2070
#define LC3G1POL                      2071
#define CLC3POL_G1POL                 2072
#define LC3G2POL                      2073
#define CLC3POL_G2POL                 2074
#define CLC3POL_G3POL                 2075
#define LC3G3POL                      2076
#define LC3G4POL                      2077
#define CLC3POL_G4POL                 2078
#define LC3POL                        2079
#define CLC3POL_POL                   2080
#define CLC3SEL0                      2081
#define CLC3SEL0_D1S0                 2082
#define LC3D1S0                       2083
#define LC3D1S                        2084
#define CLC3SEL0_D1S                  2085
#define LC3D1S1                       2086
#define CLC3SEL0_D1S1                 2087
#define LC3D1S2                       2088
#define CLC3SEL0_D1S2                 2089
#define LC3D1S3                       2090
#define CLC3SEL0_D1S3                 2091
#define LC3D1S4                       2092
#define CLC3SEL0_D1S4                 2093
#define CLC3SEL1                      2094
#define CLC3SEL1_D2S                  2095
#define CLC3SEL1_D2S0                 2096
#define LC3D2S                        2097
#define LC3D2S0                       2098
#define CLC3SEL1_D2S1                 2099
#define LC3D2S1                       2100
#define CLC3SEL1_D2S2                 2101
#define LC3D2S2                       2102
#define CLC3SEL1_D2S3                 2103
#define LC3D2S3                       2104
#define LC3D2S4                       2105
#define CLC3SEL1_D2S4                 2106
#define CLC3SEL2                      2107
#define CLC3SEL2_D3S0                 2108
#define LC3D3S                        2109
#define CLC3SEL2_D3S                  2110
#define LC3D3S0                       2111
#define LC3D3S1                       2112
#define CLC3SEL2_D3S1                 2113
#define LC3D3S2                       2114
#define CLC3SEL2_D3S2                 2115
#define LC3D3S3                       2116
#define CLC3SEL2_D3S3                 2117
#define LC3D3S4                       2118
#define CLC3SEL2_D3S4                 2119
#define CLC3SEL3                      2120
#define CLC3SEL3_D4S0                 2121
#define LC3D4S0                       2122
#define LC3D4S                        2123
#define CLC3SEL3_D4S                  2124
#define LC3D4S1                       2125
#define CLC3SEL3_D4S1                 2126
#define LC3D4S2                       2127
#define CLC3SEL3_D4S2                 2128
#define LC3D4S3                       2129
#define CLC3SEL3_D4S3                 2130
#define LC3D4S4                       2131
#define CLC3SEL3_D4S4                 2132
#define CLC3GLS0                      2133
#define CLC3GLS0_D1N                  2134
#define LC3G1D1N                      2135
#define LC3G1D1T                      2136
#define CLC3GLS0_D1T                  2137
#define LC3G1D2N                      2138
#define CLC3GLS0_D2N                  2139
#define CLC3GLS0_D2T                  2140
#define LC3G1D2T                      2141
#define CLC3GLS0_D3N                  2142
#define LC3G1D3N                      2143
#define LC3G1D3T                      2144
#define CLC3GLS0_D3T                  2145
#define CLC3GLS0_D4N                  2146
#define LC3G1D4N                      2147
#define CLC3GLS0_D4T                  2148
#define LC3G1D4T                      2149
#define CLC3GLS1                      2150
#define LC3G2D1N                      2151
#define CLC3GLS1_D1N                  2152
#define CLC3GLS1_D1T                  2153
#define LC3G2D1T                      2154
#define LC3G2D2N                      2155
#define CLC3GLS1_D2N                  2156
#define LC3G2D2T                      2157
#define CLC3GLS1_D2T                  2158
#define LC3G2D3N                      2159
#define CLC3GLS1_D3N                  2160
#define CLC3GLS1_D3T                  2161
#define LC3G2D3T                      2162
#define LC3G2D4N                      2163
#define CLC3GLS1_D4N                  2164
#define LC3G2D4T                      2165
#define CLC3GLS1_D4T                  2166
#define CLC3GLS2                      2167
#define LC3G3D1N                      2168
#define CLC3GLS2_D1N                  2169
#define LC3G3D1T                      2170
#define CLC3GLS2_D1T                  2171
#define CLC3GLS2_D2N                  2172
#define LC3G3D2N                      2173
#define CLC3GLS2_D2T                  2174
#define LC3G3D2T                      2175
#define CLC3GLS2_D3N                  2176
#define LC3G3D3N                      2177
#define LC3G3D3T                      2178
#define CLC3GLS2_D3T                  2179
#define CLC3GLS2_D4N                  2180
#define LC3G3D4N                      2181
#define CLC3GLS2_D4T                  2182
#define LC3G3D4T                      2183
#define CLC3GLS3                      2184
#define LC3G4D1N                      2185
#define CLC3GLS3_G4D1N                2186
#define LC3G4D1T                      2187
#define CLC3GLS3_G4D1T                2188
#define LC3G4D2N                      2189
#define CLC3GLS3_G4D2N                2190
#define CLC3GLS3_G4D2T                2191
#define LC3G4D2T                      2192
#define LC3G4D3N                      2193
#define CLC3GLS3_G4D3N                2194
#define CLC3GLS3_G4D3T                2195
#define LC3G4D3T                      2196
#define LC3G4D4N                      2197
#define CLC3GLS3_G4D4N                2198
#define LC3G4D4T                      2199
#define CLC3GLS3_G4D4T                2200
#define STATUS_SHAD                   2201
#define C_SHAD                        2202
#define DC_SHAD                       2203
#define Z_SHAD                        2204
#define WREG_SHAD                     2205
#define BSR_SHAD                      2206
#define PCLATH_SHAD                   2207
#define FSR0L_SHAD                    2208
#define FSR0H_SHAD                    2209
#define FSR1L_SHAD                    2210
#define FSR1H_SHAD                    2211
#define STKPTR                        2212
#define TOSL                          2213
#define TOSH                          2214

#endif // _PIC16LF1764_H_
